tutorials/surfaceTracking/interTrackFoam/hydrofoil/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.1                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/ztukovic/OpenFOAM/ztukovic-1.1/run/PhDRun/hydrofoil";
    case "hydrofoil-buffer";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
bottom
{
    type wall;
    nFaces 310;
    startFace 14213;
}

hydrofoil
{
    type wall;
    nFaces 34;
    startFace 14523;
}

freeSurface
{
    type patch;
    nFaces 310;
    startFace 14557;
}

outlet
{
    type patch;
    nFaces 4;
    startFace 14867;
}

inlet
{
    type patch;
    nFaces 4;
    startFace 14871;
}

frontAndBackPlanes
{
    type empty;
    nFaces 14544;
    startFace 14875;
}
)

// ************************************************************************* //
