tutorials/surfaceTracking/interTrackFoam/hydrofoil/system/tetFemSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          tetFemSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    motionU CG
    {
        preconditioner
        {
            type         Cholesky;
        }

        tolerance        1e-09;
        relTol           0;
    };

}

// ************************************************************************* //
